oneWayCoupledVdfTransportFoam/spray1D/monoModal_nonLinear/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    liquid
);

boundaries
{
    inlet
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet
    {
        type    zeroGradient;
    }

    wedge1
    {
        type    wedge;
    }
    wedge2
    {
        type    wedge;
    }

    top
    {
        type    zeroGradient;
    }

    axis
    {
        type    empty;
    }
}

z0 0.1;
V0 uniform 5.0;
U0 #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
        #include "constants.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/OpenFOAM/lnInclude \
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        const pointField& points = mesh.boundary()["inlet"].Cf();

        scalar z0 = 0.1;
        scalar V0 = 5.0;
        scalarField u(points.size());
        forAll (points, celli)
        {
            scalar x = points[celli].x();
            scalar y = points[celli].y();
            u[celli] = y*sqr(z0/x)*V0/x;
        }
        os << "nonuniform " << u << endl;
    #};
};

liquid
{
    type                weightsAndAbscissae;
    weightDimension     [0 0 0 0 0 0 0];
    abscissaDimension0  [0 1 0 0 0 0 0];
    abscissaDimension   [0 1 -1 0 0 0 0];

    inlet
    {
        scale uniform 0.57e-2;
        node0
        {
            weight  uniform 6.006252029938378e-03;
            abscissae0 uniform 8.815919999999999e-06;

            abscissae1 $V0;
            abscissae2 $U0;
        }
        node1
        {
            weight  uniform 2.761349043878810e-01;
            abscissae0 uniform 2.208180000000000e-05;

            abscissae1 $V0;
            abscissae2 $U0;
        }
        node2
        {
            weight  uniform 6.124198926727759e-01;
            abscissae0 uniform 3.656800000000000e-05;

            abscissae1 $V0;
            abscissae2 $U0;
        }
        node3
        {
            weight  uniform 1.054389509094048e-01;
            abscissae0 uniform 5.678199999999999e-05;

            abscissae1 $V0;
            abscissae2 $U0;
        }
    }
    internal
    {}
}


// ************************************************************************* //
